<%@ page contentType="text/html;charset=UTF-8" %>
<h1>Сервлетні фільтри</h1>
<p>
    Фільтри у веб-проєктах це реалізація концепції Middleware -
    утворення ланцюга обробників, через які проходить кожен запит
    (як у прямому, так і у зворотному шляху).
    Фільтри спрацьовують раніше ніж сервлети.
</p>
<p>
    Зручність фільтрів ще й у тому, що вони спрацьовують для усіх
    методів запиту до того, як вони почнуть розгалужуватись у
    сервлетах.
</p>
<p>
    Аналогічно до сервлетів, фільтри треба реєструвати і для них так само
    доступна анотація @WebFilter("route"), але анотації не дозволяють керувати
    порядком виконання фільтрів. Для гарантії цього порядку фільтри реєструють
    у файлі web.xml
</p>
<p>
    Дані з фільтру можна передавати далі по ланці у т.ч. до сервлетів і JSP через
    атрибути запиту. До даної сторінки переданий параметр "charset" =
    <%= request.getAttribute("charset") %>
</p>
Д.З. Переробити сторінку about-jsp до схеми з шаблоном (і сервлетом)
Створити фільтр, який буде визначати з якого браузера надішов запит
(з заголовку User-Agent) та перекладати ці дані в атрибут запиту. У складі
футеру додати відомості про браузер, з якого ведеться робота.